Revit 2027 API
MEPNetworkSegmentData.GetDownstreamSegments Method
 Gets all downstream network segments.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<MEPNetworkSegmentId> GetDownstreamSegments()
Public Function GetDownstreamSegments As IList(Of MEPNetworkSegmentId)
public:
IList<MEPNetworkSegmentId^>^ GetDownstreamSegments()
member GetDownstreamSegments : unit -> IList<MEPNetworkSegmentId>
Return Value
IList<MEPNetworkSegmentId>
 The list of segments that flow out of this segment.
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace